Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
/**
 * MiniSpeedCam - ESP32 Firmware (Hardware revision 1.1)
 * -----------------------------------------------------
 * Top-level entry point for the MiniSpeedCam ESP32-S3.
 *
 * High-level responsibilities:
 *   - Polls the STM32 (which performs FFT on the CDM324 radar signal)
 *     over UART for the current vehicle speed.
 *   - When speed crosses the user-configured threshold, captures a JPEG
 *     from the OV2640 camera and POSTs it (base64-encoded) along with
 *     the maximum measured speed to minispeedcam.com.
 *   - Hosts a self-hosted web config portal (esp_http_server on :80, over
 *     WiFi STA or a captive AP if no credentials are stored) for configuring
 *     WiFi, units (MPH/KPH), minimum tracking speed, and photo trigger speed.
 *   - Implements a two-task split across the dual-core ESP32:
 *       Core 1 (Task1) - radar polling, sleep management, DNS.
 *       Core 0 (Task0) - HTTPS uploads and (re)connecting to WiFi.
 *
 * PlatformIO port of esp32_firmware/esp32_firmware.ino. The module
 * headers below contain their definitions and are compiled as a single
 * translation unit (exactly as the Arduino IDE concatenated the .ino
 * tabs), so behaviour is identical to the original sketch.
 *
 * Required libraries (see platformio.ini lib_deps):
 *   - ArduinoJson (config-portal /api/state + OTA manifest parsing)
 * The web config portal and aiming-stream server both use the IDF-native
 * esp_http_server (no ESPAsyncWebServer / AsyncTCP).
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <esp_camera.h>
#include <DNSServer.h>
#include <ESPmDNS.h>
#include <Preferences.h>

#include "soc/soc.h"           // Disable brownout problems
#include "soc/rtc_cntl_reg.h"  // Disable brownout problems
#include "driver/rtc_io.h"
#include "SPIFFS.h"
#include "esp_core_dump.h"     // read the previous crash's saved backtrace on boot
#include "esp_system.h"        // esp_reset_reason()

// --- GPIO assignments (board revision 1.1) ---
#define STM32_RESET_PIN GPIO_NUM_47  // Drives STM32 NRST low to reset the radar MCU
#define STM32_BOOT0_PIN GPIO_NUM_14  // Drives STM32 BOOT0 (HIGH = ROM bootloader) for ESP-driven flashing
#define RX_GPIO 42                   // UART1 RX from STM32 (speed reports)
#define TX_GPIO 41                   // UART1 TX to STM32 (speed query commands)
#define ESP_WAKEUP_PIN GPIO_NUM_1    // STM32 pulls HIGH when motion >= ~5mph is detected
#define STM_WAKEUP_PIN GPIO_NUM_2    // (was the reserved STM_WAKEUP line; now the radar-blank line below)
#define RADAR_BLANK_PIN STM_WAKEUP_PIN  // ESP -> STM32 PA4: HIGH during WiFi bursts so the STM32 discards rail-corrupted FFT frames
#define WIFI_RESET_PIN GPIO_NUM_21   // Active-low button: hold 3s to clear stored WiFi creds

#define CAMERA_PWDN_PIN GPIO_NUM_45  // OV2640 power-down (active high)
#define CAMERA_RST_PIN GPIO_NUM_3    // OV2640 reset (active low)

Preferences preferences;  // NVS-backed key/value store for WiFi creds and user settings

// Post-boot window during which WiFi/portal stays up so the user can reach the
// config page after a reboot; Power-Saver then drops WiFi when idle. (Was
// mistakenly shipped as a 10s debug value -- the trailing "//120000" gave it
// away -- which left almost no window to reach the portal and killed the first
// OTA check before it could run.)
static const unsigned long POST_BOOT_WIFI_GRACE_MS = 120000;

#include "variables.h"
#include "events.h"          // recent-detection ring served by GET /api/events (LAN companions)
#include "diagnostics.h"
#include "camera.h"
#include "camera_stream.h"
#include "radar.h"
#include "api.h"
#include "stm32boot.h"
#include "ota.h"
#include "config_portal.h"

DNSServer dnsServer;  // Captive-DNS used in AP mode so any URL hits the config portal

TaskHandle_t Task0;  // Handle for the Core 0 task (HTTPS uploads / WiFi reconnect)
TaskHandle_t Task1;  // Handle for the Core 1 task (radar polling / sleep / DNS)

// Forward declarations for the dual-core task functions (defined below).
void taskCore0(void* parameter);
void taskCore1(void* parameter);

// The aiming MJPEG stream server lives in its own translation unit
// (camera_stream.cpp). Its desired state is the shared stream_active/
// stream_deadline flags (set by POST /api/stream), and the config page reports
// the live stream URL/state by polling GET /api/state -- so the stream module
// needs no start/stop callbacks wired here anymore.

// --- Crash diagnostics ------------------------------------------------------
// The panic handler saves a core dump to the flash 'coredump' partition on every
// crash, but the native USB-CDC console drops off during the crash so the live
// panic is never seen. Print the saved dump once on the next boot (USB-CDC is
// back by then), then erase it. Decode the printed addresses with:
//   xtensa-esp32s3-elf-addr2line -pfiaC -e .pio/build/esp32-s3/firmware.elf <addr ...>
static void reportLastCrash() {
  if (esp_core_dump_image_check() != ESP_OK) {
    return;  // no valid core dump in flash -> last boot was clean
  }
  Serial.println("!!! ===== PREVIOUS CRASH: core dump found in flash ===== !!!");
#if CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH && CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF
  char reason[200];
  if (esp_core_dump_get_panic_reason(reason, sizeof(reason)) == ESP_OK) {
    Serial.printf("  reason   : %s\n", reason);
  }
  esp_core_dump_summary_t* s = (esp_core_dump_summary_t*) malloc(sizeof(*s));
  if (s != nullptr && esp_core_dump_get_summary(s) == ESP_OK) {
    Serial.printf("  task     : %s\n", s->exc_task);
    Serial.printf("  PC       : 0x%08x  (exccause %u, fault addr 0x%08x)\n",
                  (unsigned)s->exc_pc, (unsigned)s->ex_info.exc_cause,
                  (unsigned)s->ex_info.exc_vaddr);
    Serial.print("  backtrace:");
    for (uint32_t i = 0; i < s->exc_bt_info.depth; i++) {
      Serial.printf(" 0x%08x", (unsigned)s->exc_bt_info.bt[i]);
    }
    Serial.println(s->exc_bt_info.corrupted ? "  (stack corrupted)" : "");
  }
  free(s);
#endif
  Serial.println("  decode   : xtensa-esp32s3-elf-addr2line -pfiaC -e .pio/build/esp32-s3/firmware.elf <PC + backtrace>");
  esp_core_dump_image_erase();  // clear so it prints once per crash, not every boot
  Serial.println("!!! ==================================================== !!!");
}

/**
 * Arduino setup() - runs once on boot/reset.
 *
 * Initializes peripherals, restores user settings from NVS, brings the
 * STM32 radar out of reset, joins WiFi (or starts the configuration AP),
 * launches the web config portal, and finally pins the two work loops to
 * separate cores so radar polling never blocks on HTTPS uploads.
 */
void setup() {
  Serial.begin(115200);
  // On native-USB CDC the port enumerates ~1-2s after reset, so early prints
  // are lost if we don't wait for the host to attach. Bound the wait so the
  // device never hangs when running headless (no monitor) in the field.
  unsigned long serialWaitStart = millis();
  while (!Serial && millis() - serialWaitStart < 2000) { delay(10); }

  Serial.println();
  Serial.println("=== MiniSpeedCam r1.1 (PlatformIO) ===");
  Serial.printf("[BOOT] heap=%u psram=%u\n", (unsigned)ESP.getFreeHeap(), (unsigned)ESP.getFreePsram());

  // GPIO setup
  pinMode(ESP_WAKEUP_PIN, INPUT);
  pinMode(WIFI_RESET_PIN, INPUT_PULLUP);  // Active-low button; enable internal pull-up so the pin idles HIGH (no spurious resets)
  pinMode(STM32_RESET_PIN, OUTPUT);
  pinMode(STM32_BOOT0_PIN, OUTPUT);
  digitalWrite(STM32_BOOT0_PIN, LOW);  // BOOT0 low = STM32 boots from flash (normal run)
  pinMode(RADAR_BLANK_PIN, OUTPUT);
  digitalWrite(RADAR_BLANK_PIN, LOW);  // default: not blanking the radar
  pinMode(CAMERA_PWDN_PIN, OUTPUT);  // Set the camera powerdown pin
  pinMode(CAMERA_RST_PIN, OUTPUT);   // Set the camera reset pin // Causes crash

  // Light Sleep setup
  //esp_sleep_enable_ext0_wakeup(ESP_WAKEUP_PIN, 1);  // Wake up ESP32 when GPIO1 is HIGH //STM will always pull GIO1 high when speeds above 5 mph are detected. Will pull low when speeds

