Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
    dnsServer.processNextRequest();  // Process captive-DNS request for the config portal

    streamService();  // enforce the aiming-stream 5-minute auto-off timeout

    // While the aiming stream is up, skip all measurement work below: the radar
    // reads are meaningless (and WiFi-TX-corrupted) during aiming, and keeping
    // taskCore1 quiet here frees the radio/CPU for a smooth stream. streamBusy()
    // keeps us off the camera until the streaming task has fully exited and
    // restored the sensor to UXGA, so a speed photo can't race the frame-size
    // switch. The short yield replaces get_speed()'s usual loop pacing.
    if (stream_active || streamBusy()) {
      vTaskDelay(pdMS_TO_TICKS(20));
      continue;
    }

    // While Core 0 is reflashing the STM32 it owns UART1 for the bootloader, so
    // taskCore1 must not poll the radar over the same UART until it's done.
    if (stm_flash_busy) {
      vTaskDelay(pdMS_TO_TICKS(50));
      continue;
    }

    if (ignore_flag == true) {
      if (millis() >= ignore_time) {
        ignore_flag = false;  // Only if 5 seconds passed
      }
    }

    if (is_kph == true) {
      speed = get_speed(true);  // Get speed (KPH) from STM32 via UART
    } else {
      speed = get_speed(false);  // Get speed (MPH) from STM32 via UART
    }

    // No server-side display push here: the config page pulls live readouts
    // (speed, signal, heap, ...) by polling GET /api/state ~1 Hz. This is what
    // removing ESPUI bought us -- the old per-loop WebSocket broadcast over
    // AsyncTCP is exactly what blocked this task and froze the device (~30s:
    // radar, serial, stream all stalled until TCP timed out) under stream load.

    // Echo the live speed to the serial monitor, throttled to ~1 Hz so the
    // fast radar-poll loop doesn't flood the console.
    static unsigned long lastSpeedPrint = 0;
    if (millis() - lastSpeedPrint >= 1000) {
      lastSpeedPrint = millis();
      Serial.printf("[SPEED] %d %s\n", speed, is_kph ? "kph" : "mph");
    }

    /* SLEEP - 120 Seconds after startup
     *  Gives time for user to make changes over WiFi.
     *  Skipped entirely when Power-Saver Mode is off (device stays awake).
     */

    // Never power down WiFi while unconfigured: the soft-AP must stay up so
    // the user can open the portal and enter credentials (ssid == "NOT_SET").
    if (power_saver && !stream_active && ssid != "NOT_SET" && wake_flag == true) {
      if (millis() >= sleep_time) {              // Only if the grace window elapsed
        // Don't drop WiFi out from under an in-flight upload/OTA (coreNetBusy),
        // and don't drop it while the radar link looks dead (stmLinkDead) -- keep
        // the portal/OTA reachable so the STM can be reflashed instead of the
        // device stranding offline. In either case push the deadline out so the
        // grace window simply restarts once Core 0 goes quiet / the radar is back.
        if (coreNetBusy() || stmLinkDead()) {
          sleep_time = millis() + 5000;
        } else if (digitalRead(ESP_WAKEUP_PIN) == 0) {  // Only if STM not measuring data
          wake_flag = false;
          Serial.println("[PWR] idle: WiFi off (post-boot grace elapsed)");

          //esp_light_sleep_start(); // Do not sleep in version 1.1
          WiFi.disconnect(true);  // Disconnect from network, optionally true to remove credentials
          WiFi.mode(WIFI_OFF);    // Set Wi-Fi mode to OFF

          // Add power camera off to save battery
          // To initiate hardware power-down, the PWDN pin must be tied to high.
          // Power camera on after speed is detected
          //cameraPowerOn();  // power on camera after waking?
        }
      }
    }

    /* SLEEP - 5 seconds of no activity on radar (Power-Saver Mode only) */
    unsigned long currentMillis = millis();

    if (power_saver && !stream_active && ssid != "NOT_SET" && wake_flag == false) {
      if (coreNetBusy() || stmLinkDead()) {
        // In-flight upload/OTA, or a dead radar link: hold WiFi up and restart
        // the 5s idle window so we don't tear the radio down mid-transfer (the
        // transfer itself blanks the radar, forcing speed==0 -- the very thing
        // that would otherwise arm this timer).
        previousMillis = currentMillis;
      } else if (speed == 0) {  // Check if speed is 0
        if (currentMillis - previousMillis >= interval) {
          previousMillis = currentMillis;      // Save the last time
          Serial.println("[PWR] idle: WiFi off (no radar activity 5s)");

          //esp_light_sleep_start(); // Do not Go to sleep on R1.1 because USB will disconnect
          WiFi.disconnect(true);  // Disconnect from network, optionally true to remove credentials
          WiFi.mode(WIFI_OFF);    // Set Wi-Fi mode to OFF
          previousMillis = millis();

          // Add power camera off to save battery
          // To initiate hardware power-down, the PWDN pin must be tied to high.
          // Power camera on after speed is detected
          //cameraPowerOn();  // power on camera after waking?
        }
      }
    }

    // Checks if wifi is disconnected and sets connect flag to true. Connection will occur on Core 0
    if (digitalRead(ESP_WAKEUP_PIN) == 1) { // Check if speed detected on radar first. Use interrupt for this instead?
      // Only request a reconnect when we actually have credentials to use.
      // In AP config mode (ssid == "NOT_SET") WiFi.status() is never
      // WL_CONNECTED, so without this guard we'd flag a reconnect every loop
      // and connectWifi() would tear the soft-AP down.
      // ...but not while we're in config-AP fallback: chasing an unreachable
      // STA there would tear the portal down (handled in connectWifi() too).
      if (!ap_fallback_mode && ssid != "NOT_SET" && !ssid.isEmpty() && WiFi.status() != WL_CONNECTED) {
        connect_wifi = true;
      }
      // Power on camera here? Need to check if it's powered down first

