Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
    }

    // Pause speed tracking while the aiming stream is up: the device is being
    // mounted (not measuring), and the stream task owns the camera framebuffer.
    if (ignore_flag == false && !stream_active) {
      // A sample qualifies to arm a run only if it is both fast enough AND
      // close enough: speed >= min_speed and the radar echo magnitude >=
      // min_signal (the proximity gate -- distant cross-traffic returns a weak
      // peak even at speed, so it never qualifies). min_signal == 0 disables
      // the gate (g_last_peak_mag >= 0 is always true), preserving prior
      // behavior until the user calibrates it.
      const bool qualifies =
          (speed >= min_speed) && ((int)g_last_peak_mag >= min_signal);

      // Telemetry: a sample fast enough to arm but too weak (distant cross-
      // traffic the proximity gate dropped). Counts the rejection rate so the
      // gate can be judged remotely. Only meaningful when the gate is enabled.
      if (min_signal > 0 && speed >= min_speed && (int)g_last_peak_mag < min_signal) {
        g_reject_proximity++;
      }

      // Debounce: count consecutive qualifying readings; a single glitch
      // resets the count, so it can never reach SPEED_CONFIRM_COUNT.
      static int speedConfirmCount = 0;
      if (qualifies) {
        speedConfirmCount++;
      } else {
        speedConfirmCount = 0;
      }

      if (qualifies && speedConfirmCount >= SPEED_CONFIRM_COUNT) {
        speedConfirmCount = 0;  // consumed; the run loop below tracks the pass

        Serial.printf("[RUN] start: speed=%d >= min_speed=%d, mag=%u >= min_signal=%d (confirmed)\n",
                      speed, min_speed, (unsigned)g_last_peak_mag, min_signal);

        g_run_active = true;  // tell Core 0's auto-update service a pass is in progress (don't reboot/seize UART)
        delay(100);
        maxSpeed = 0;               // Tracks the max speed over the entire pass
        bool photo_taken = false;   // ensures we capture at most one frame per run
        uint8_t* photo_buf = nullptr;  // ps_malloc'd JPEG copy handed to Core 0 (decoupled from the camera fb pool)
        size_t   photo_len = 0;

        // --- Per-event telemetry accumulators (uploaded with the run) ------
        // Seeded from the arming sample so it's counted; updated each loop.
        const unsigned long run_start = millis();
        uint32_t speed_sum = (speed > 0) ? (uint32_t)speed : 0;  // for mean speed
        uint16_t sample_count = (speed > 0) ? 1 : 0;             // valid frames in the run
        uint16_t peak_snr = g_last_peak_snr;                     // strongest SNR seen
        int direction = 0;                                       // 0 unk, 1 approaching, 2 receding
        // Echo-energy centroid across the run: Sigma(echo_index * mag) / Sigma(mag)
        // over every valid echo locates where the strongest reflections sit in
        // time. Magnitude rises for an oncoming car and falls for a receding one,
        // so energy weighted toward the END of the run => still closing
        // (approaching), toward the START => already leaving (receding), centered
        // => symmetric pass (ambiguous). Uses all samples, so a single noisy
        // reading can't flip it the way a first-vs-last compare could. Drives the
        // direction fallback below and the mag_trend telemetry field. Seeded with
        // the arming echo at index 0.
        uint64_t mag_idx_sum = 0;                                // Sigma(echo_index * mag)
        uint32_t mag_wt_sum  = g_last_peak_mag;                  // Sigma(mag)
        uint16_t echo_n      = (g_last_peak_mag > 0) ? 1 : 0;    // valid echoes counted (mag > 0)

        // --- Direction-aware photo timing (proximity, two thresholds) -------
        // With the unit aimed down the road the echo magnitude (g_last_peak_mag,
        // ~1/r^4) RISES for an oncoming car and FALLS for a receding one. We fire
        // the FRONT shot when a rising echo crosses UP through thr_front, and the
        // REAR shot when a falling echo crosses DOWN through thr_rear. Two
        // thresholds because a car's front reflects far stronger than its rear
        // (so one value frames them at different distances) AND the shots want
        // different framing: RAISE thr_front to catch oncoming closer, LOWER
        // thr_rear to catch receding farther out. Each inherits the shared
        // photo_signal when left at 0, so the old one-knob config still works;
        // both 0 keeps the legacy "first frame past photo_speed" behavior. Keep
        // both >= Min Signal (the arming gate), and Min Signal below thr_front so
        // an oncoming car arms before it crosses (else only the rear/peak fires).
        const int thr_front = (photo_signal_front > 0) ? photo_signal_front : photo_signal;
        const int thr_rear  = (photo_signal_rear  > 0) ? photo_signal_rear  : photo_signal;
        const bool prox_enabled = (thr_front > 0) || (thr_rear > 0);
        bool prev_above_front = (thr_front > 0) && ((int)g_last_peak_mag >= thr_front);
        bool prev_above_rear  = (thr_rear  > 0) && ((int)g_last_peak_mag >= thr_rear);
        uint16_t peak_mag = g_last_peak_mag;
        const char* plate = "legacy";

        while (speed >= min_speed) {  // Track the car's maximum speed over the whole pass.
          // Failsafe: a genuine pass is over in seconds. If we're still here after
          // MAX_RUN_MS the input is sustained noise or a bad config -- finalize
          // what we have and re-arm rather than let this loop wedge the task.
          if (millis() - run_start > MAX_RUN_MS) {
            Serial.println("[RUN] max duration exceeded (noise/misconfig?); finalizing");
            break;
          }
          speed = get_speed(is_kph);  // Get speed (KPH or MPH per setting) from STM32 via UART
          // (live readout is served on demand via GET /api/state; nothing to push here)

          if (speed > maxSpeed) {
            maxSpeed = speed;
            Serial.print("New maxSpeed: ");
            Serial.println(maxSpeed);
          }

          // Run-profile telemetry: accumulate valid samples for the mean speed.
          if (speed > 0) {
            speed_sum += (uint32_t)speed;
            sample_count++;
          }

          // A 0 magnitude is "no valid target this sample" -- the STM32 had no
          // fresh FFT, or the reply failed the checksum (both common on this
          // noisy shared-rail board; see INTERFACE.md / get_speed()). It is NOT
          // "the echo fell to zero," so it must not look like a DOWN-crossing:
          // that would fire a bogus REAR-plate shot (and latch photo_taken) on a
          // single dropped or corrupted reply. So act only on samples that carry
          // a real echo and hold the crossing state across a dropout. Legacy mode
          // (prox disabled) ignores magnitude and is unaffected.
          if (prox_enabled && g_last_peak_mag == 0) {
            // dropped/noisy sample: no proximity info -- hold crossing state
          } else {
            if (g_last_peak_mag > peak_mag) peak_mag = g_last_peak_mag;
            if (g_last_peak_snr > peak_snr) peak_snr = g_last_peak_snr;
            if (g_last_peak_mag > 0) {       // valid echo: fold into the energy centroid
              mag_idx_sum += (uint64_t)echo_n * g_last_peak_mag;  // index = current echo_n
              mag_wt_sum  += g_last_peak_mag;
              echo_n++;
            }
            const bool now_above_front = (thr_front > 0) && ((int)g_last_peak_mag >= thr_front);
            const bool now_above_rear  = (thr_rear  > 0) && ((int)g_last_peak_mag >= thr_rear);

