Valar-Systems/MiniSpeedCam/version/r1.1/firmware/platformio/esp32_firmware_platformio/src/main.cpp
    delay(100);
  }
}

/**
 * Core 0 task: networking I/O.
 *
 * Kept off Core 1 so the relatively slow HTTPS upload (and any WiFi
 * reconnect retries) never delays the radar polling loop. Blocks on
 * uploadQueue for finished-run events from Core 1 (no busy polling); the
 * short receive timeout also lets it service proactive WiFi reconnects
 * requested via connect_wifi.
 */
void taskCore0(void* parameter) {
  // Periodic telemetry heartbeat. sendLocalIP() carries the device-health
  // snapshot (RSSI, heap + low-water mark, uptime, reset reason, rejection
  // counters), so it must be re-sent on an interval -- the once-at-boot call in
  // setup() reports those runtime fields while they're still ~0. It self-guards
  // on STA + connected, so it's a no-op in AP/config mode or while asleep.
  const unsigned long HEARTBEAT_INTERVAL_MS = 10UL * 60UL * 1000UL;  // 10 min: fewer WiFi-TX bursts -> less battery drain (and radar interference)
  unsigned long lastHeartbeat = millis();

  while (1) {

    UploadRequest req;
    if (xQueueReceive(uploadQueue, &req, pdMS_TO_TICKS(200)) == pdTRUE) {
      Serial.printf("[UPLOAD] dequeued event: speed=%d has_photo=%d\n", req.speed_actual, (int)req.has_photo);
      sendUpload(req);
      if (req.photo_buf != nullptr) {
        free(req.photo_buf);  // release the PSRAM JPEG copy Core 1 handed us
      }
    }

    if (connect_wifi == true) {
      Serial.println("[WIFI] reconnect requested");
      connectWifi();
      connect_wifi = false;
    }

    if (millis() - lastHeartbeat >= HEARTBEAT_INTERVAL_MS) {
      lastHeartbeat = millis();
      sendLocalIP();  // telemetry heartbeat (no-op unless STA + connected)
    }

    serviceRegistration();  // trust-on-first-use device registration (retries w/ backoff until 200)
    otaHealthService();  // commit-or-revert a freshly-applied ESP image once it proves healthy
    otaAutoService();    // poll GitHub on a timer and auto-apply newer firmware while idle
  }
}
